MaterialFoundry/MaterialFoundry_Arduino/variants/materialPlane_sensor_diy_full/pins_arduino.h
#ifndef Pins_Arduino_h
#define Pins_Arduino_h

#include <stdint.h>

#define EXTERNAL_NUM_INTERRUPTS 16
#define NUM_DIGITAL_PINS        40
#define NUM_ANALOG_INPUTS       16

#define analogInputToDigitalPin(p)  (((p)<20)?(analogChannelToDigitalPin(p)):-1)
#define digitalPinToInterrupt(p)    (((p)<40)?(p):-1)
#define digitalPinHasPWM(p)         (p < 34)

static const uint8_t TX = 1;
static const uint8_t RX = 3;

static const uint8_t SDA = 21;
static const uint8_t SCL = 22;

static const uint8_t SS    = 5;
static const uint8_t MOSI  = 23;
static const uint8_t MISO  = 19;
static const uint8_t SCK   = 18;

static const uint8_t A0 = 36;
static const uint8_t A3 = 39;
static const uint8_t A4 = 32;
static const uint8_t A5 = 33;
static const uint8_t A6 = 34;
static const uint8_t A7 = 35;
static const uint8_t A10 = 4;
static const uint8_t A11 = 0;
static const uint8_t A12 = 2;
static const uint8_t A13 = 15;
static const uint8_t A14 = 13;
static const uint8_t A15 = 12;
static const uint8_t A16 = 14;
static const uint8_t A17 = 27;
static const uint8_t A18 = 25;
static const uint8_t A19 = 26;

static const uint8_t T0 = 4;
static const uint8_t T1 = 0;
static const uint8_t T2 = 2;
static const uint8_t T3 = 15;
static const uint8_t T4 = 13;
static const uint8_t T5 = 12;
static const uint8_t T6 = 14;
static const uint8_t T7 = 27;
static const uint8_t T8 = 33;
static const uint8_t T9 = 32;

static const uint8_t DAC1 = 25;
static const uint8_t DAC2 = 26;

/* Material Plane Sensor specific definitions */

#define HARDWARE_VARIANT                    "DIY Full"
#define HARDWARE_VERSION                    "1.0"
#define NATIVE_USB                          false
#define IR_SENSOR                           "WiiCam"
#define ID_SENSOR                           false
#define BATTERY_LED                         true
#define CONNECTION_LED                      true
#define BATTERY_MONITOR                     "TinyPICO"

//I2C pins for WiiMote camera
static const uint8_t SDA_PIN        = 21;
static const uint8_t SCL_PIN        = 22;

//LED pins
static const uint8_t LED_GREEN_PIN  = 27;   //Green led pin
static const uint8_t LED_GREEN      = 0;    //Green led channel
static const uint8_t LED_RED_PIN    = 15;    //Red led pin
static const uint8_t LED_RED        = 1;    //Red led channel
static const uint8_t LED_GREEN2_PIN = 25;   //Green led pin
static const uint8_t LED_GREEN2     = 2;    //Green led channel
static const uint8_t LED_RED2_PIN   = 26;    //Red led pin
static const uint8_t LED_RED2       = 3;    //Red led channel

//USB active
static const uint8_t USB_ACTIVE_PIN = 32;

#endif /* Pins_Arduino_h */
